<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of MKVToolNix.</string>
	<key>Identifier</key>
	<string>com.github.vinrobot.download.mkvtoolnix</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MKVToolNix</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.rustymyers.SharedProcessors/FossHubURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>app_name</key>
				<string>MKVToolNix</string>
				<key>app_type</key>
				<string>macOS</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>request_headers</key>
				<dict>
					<key>Referer</key>
					<string>https://www.fosshub.com/MKVToolNix.html</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/MKVToolNix-%version%.app</string>
				<key>requirement</key>
				<string>identifier "download.mkvtoolnix.MKVToolNix" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = YZ9DVS8D8C</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
